Pilperi/ATtiny-i2c/demo/pcf8582.c
#include <stdint.h>
#include <avr/io.h>
#include "pcf8582.h"
#include <attiny_i2c.h>

/* Kirjoita bufferin data laitteelle */
void pcf8582_kirjoita_bufferi(uint8_t laiteosoite, uint8_t aloitusosoite,
                              uint8_t* bufferi_data, uint8_t bufferin_koko)
{
    uint8_t ack_vastaus;
    i2c_setup(I2C_MOODI_SOFTAKELLO);
    i2c_aloita();
    i2c_kirjoita(laiteosoite & ~(1<<0));
    ack_vastaus = i2c_ack(I2C_ACK_LUE);
    i2c_kirjoita(aloitusosoite);
    ack_vastaus = i2c_ack(I2C_ACK_LUE);
    for (uint8_t tavunro=0; tavunro < bufferin_koko; tavunro++)
    {
        i2c_kirjoita(bufferi_data[tavunro]);
        ack_vastaus = i2c_ack(I2C_ACK_LUE);
    }
    i2c_lopeta();
}

/* Lue bufferin verran dataa laitteelta, aloittaen aloitusosoitteesta. */
void pcf8582_lue_bufferi(uint8_t laiteosoite, uint8_t aloitusosoite,
                         uint8_t* bufferi_data, uint8_t bufferin_koko)
{
    uint8_t ack_vastaus;
    i2c_setup(I2C_MOODI_SOFTAKELLO);
    i2c_aloita();
    i2c_kirjoita(laiteosoite & ~(1<<0));
    ack_vastaus = i2c_ack(I2C_ACK_LUE);
    i2c_kirjoita(aloitusosoite);
    ack_vastaus = i2c_ack(I2C_ACK_LUE);
    i2c_aloita_rep();
    i2c_kirjoita(laiteosoite | (1<<0));
    ack_vastaus = i2c_ack(I2C_ACK_LUE);
    DDRB &= I2C_MASK_SDA_N; // Vaihdetaan lukutilaan
    for (uint8_t tavunro=0; tavunro < bufferin_koko; tavunro++)
    {
        bufferi_data[tavunro] = i2c_lue();
        ack_vastaus = i2c_ack(I2C_ACK_KIRJOITA);
    }
    i2c_lopeta();
}
